# Задание 1
# Задал некоторые переменные
a = 10
b = 11
c = 12
print(a, b, c) # Вывод переменных
# Для решения второй части предположил, что есть некий склад с настольными\компьютерными играми
d = input('Введите наименование позиции и тип игры: ')
e = int(input('Введите число остатка на складе: '))
print(d)
print(e, 'шт.')
