month = int(input("Введите целое число от 1 до 12 : "))  # Запрос месца у пользователя

# Способ через список
month -= 1
my_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
#
try:
    print(list[month])
except:
    print("Вы ввели некорректное число")

# Способ через словарь
month += 1
my_dict = {
    1: "зима",
    2: "зима",
    3: "весна",
    4: "весна",
    5: "весна",
    6: "лето",
    7: "лето",
    8: "лето",
    9: "осень",
    10: "осень",
    11: "осень",
    12: "зима"
}
print(my_dict.get(month))
